# SecondaryEngagementParameterError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..SecondaryEngagementParameterError Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
This is used to post error. "Bar Engagement 2" has an incorrect value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SecondaryEngagementParameterError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SecondaryEngagementParameterError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SecondaryEngagementParameterError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace